# Module 7 Exercises - Linear Regression

### Exercise 1:

Using the pandas library, in the datasets folder load the gradedata.csv file as a dataframe. Narrow your data (make the dataframe smaller) by choosing columns that you think can help predict student grades. Use any method that you've learned so far to help your decision on which columns to keep.

In [47]:
import pandas as pd

dfg1 = pd.read_csv('datasets/gradedata.csv')
dfg1.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [48]:
new_table = dfg1.drop(['fname', 'lname', 'address'], axis=1)
new_table.head()

   gender  age  exercise  hours  grade
0  female   17         3     10   82.4
1    male   18         4      4   78.2
2    male   18         5      9   79.3
3  female   14         2      7   83.2
4  female   18         4     15   87.4

### Exercise 2:

Using the dataframe in the exercise above, clean and prepare your data. This means to eliminate any null (missing) values (either by dropping or filling them) and to transform any data column types to numerical values that a model can interpret. For example, if the column has string values, convert them to integers that best represent their order.

In [49]:
new_table.dtypes 
new_table.loc[new_table['gender'] == 'female','gender'] = 1
new_table.loc[new_table['gender'] == 'male','gender'] = 2
new_table.head()                   #for gender convert female = 1 male = 2

   gender  age  exercise  hours  grade
0       1   17         3     10   82.4
1       2   18         4      4   78.2
2       2   18         5      9   79.3
3       1   14         2      7   83.2
4       1   18         4     15   87.4

In [51]:
new_table_no_missing = new_table.dropna()
new_table_no_missing.head()

   gender  age  exercise  hours  grade
0       1   17         3     10   82.4
1       2   18         4      4   78.2
2       2   18         5      9   79.3
3       1   14         2      7   83.2
4       1   18         4     15   87.4

In [59]:
new_table_no_missing['grade'] = new_table_no_missing['grade'].apply(lambda x: int(x)) #turns float type grades to int type  
#for grade convert to integers
new_table_no_missing.head()
new_table_no_missing.shape

(2000, 5)

### Exercise 3:

Using the cleaned dataframe in the exercise above, use the sklearn library to split the data into training and test datasets. Make the test size 30%.

In [57]:
import sklearn
from sklearn.linear_model import LinearRegression

X = new_table_no_missing.drop('grade', axis=1)

X_train, X_test, Y_train, Y_test = sklearn.model_selection.train_test_split(
    X, new_table_no_missing['grade'], test_size=0.30, random_state = 5)
print(X_train.shape)
print(X_test.shape)
print(Y_train.shape)
print(Y_test.shape)

(1400, 4)
(600, 4)
(1400,)
(600,)

### Exercise 4:

Using the training data from the previous exercise, set a linear regression function to fit the data (build the model).

### Exercise 5:

What is the intercept coefficient (y-intercept) for the linear regression model?

### Exercise 6:

Use the predict function on the training data and the test data.

### Exercise 7:

Calculate the MSE (mean squared error) of the training and test predictions. How "good" was the linear regression model at predicting the test data compared to the training data?